app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @comment = BookComment.new(book_comment_params)
    @comment.user_id = current_user.id
    @comment.book_id = @book.id
    @comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", ""], ["user_id", 1], ["book_id", 1], ["created_at", "2021-07-02 04:52:07.173252"], ["updated_at", "2021-07-02 04:52:07.173252"]]

  def destroy

    @comment = BookComment.find(params[:id])

    @comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 6]]

def correct_user

  @comment = BookComment.find(params[:id])
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]