app/controllers/favorites_controller.rb

def create
  @book = Book.find(params[:book_id])
  @favorite = current_user.favorites.new(book_id: @book.id)
  @favorite.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2021-07-01 14:34:04.252386"], ["updated_at", "2021-07-01 14:34:04.252386"]]

def destroy
  @book = Book.find(params[:book_id])
  @favorite = current_user.favorites.find_by(book_id: @book.id)
  @favorite.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]